[
  {
    "firstName": "Shawn",
    "lastName": "Stringfield",
    "email": "shawn.stringfield@gmail.com",
    "title": "Software Developer",
    "phone": "(202) 215-1120",
    "summary": "Dynamic and innovative Front End Engineer with a passion for creating engaging user experiences and cutting-edge web applications. Leveraging expertise in modern web technologies and frameworks to deliver high-quality, responsive designs. Seeking to contribute technical proficiency and creativity to a forward-thinking team.",
    "skills": [
      { "Expertise": ["UI/Responsive Design", "Front End Development", "Api Development"] },
      {
        "Languages & Frameworks": ["CSS/CSS Modules", "JS", "React", "Next.js", "Node.js", "Tailwind"]
      },
      { "Tools": ["Git/GitHub", "Webpack", "Jest", "Jasmine", "Figma"] }
    ],
    "experience": [
      {
        "jobTitle": "Ecommerce Frontend Engineer",
        "company": "Fevo (Contract)",
        "startDate": "2023/2/01",
        "endDate": "2023/12/31",
        "description": "Leveraged React to revamp the checkout process and enhance administrative functions for event promoters managing bookings online, streamlining user experience."
      },
      {
        "jobTitle": "Senior Frontend Engineer",
        "company": "CDC (Contract)",
        "startDate": "2022/4/01",
        "endDate": "2022/12/01",
        "description": "Specialized in presenting health statistics with interactive charts that simplify complex data. Developed a unified design language using specific color palettes, typography, and UI layouts."
      },
      {
        "jobTitle": "Senior Frontend Engineer",
        "company": "Ford Motor Company (Contract)",
        "startDate": "2021/11/01",
        "endDate": "2022/4/01",
        "description": "Contributed to both front-end and backend (Node.js) for Ford's collision detection software, designed the UI, and developed a design system for team use."
      },
      {
        "jobTitle": "Senior Frontend Engineer",
        "company": "Cyrpsis Group",
        "startDate": "2019/3/01",
        "endDate": "2021/6/01",
        "description": "Worked as part of an engineering team to build tools to aid incident responders in analyzing critical data relevant to their case loads."
      },
      {
        "jobTitle": "Frontend Engineer",
        "company": "Burges Group",
        "startDate": "2018/10/31",
        "endDate": "2019/3/01",
        "description": "Worked on internal tools to help researchers and QA team to test configurations for automated billing processes. Tools used to maintain this application are React, Webpack, SASS and Jest for Unit Testing"
      },
      {
        "jobTitle": "Senior Frontend Engineer",
        "company": "AARP",
        "startDate": "2016/6/01",
        "endDate": "2018/10/31",
        "description": "Managed the front-end codebase of AARP's StayingSharp, a suite of brain games enhancing cognitive skills, using React, Webpack, SASS, and Jest for unit testing."
      },
      {
        "jobTitle": "Frontend Developer",
        "company": "Symplicity",
        "startDate": "2014/09/01",
        "endDate": "2016/06/31",
        "description": "Responsible for working with a team of Visual Designers, UX Designers, and Back End Developers on various products for our education sector at Symplicity."
      },
      {
        "jobTitle": "Frontend Developer",
        "company": "FINRA",
        "startDate": "2013/7/01",
        "endDate": "2014/9/15",
        "description": "Collaborated with UX designers to implement and enhance user interfaces in an Agile environment, creating interactive prototypes and designs from wireframes and user flows."
      },
      {
        "jobTitle": "Frontend Developer",
        "company": "American Institute of Research (AIR)",
        "startDate": "2012/7/01",
        "endDate": "2013/6/01",
        "description": "I managed the front-end for the American Institute of Research’s Assessment division’s testing app, writing JavaScript to retrieve and display test items from our databases. I also implemented rich text editors and developed plugins for our CKEditor."
      },
      {
        "jobTitle": "Frontend Developer",
        "company": "U.S. News and World Report",
        "startDate": "2011/4/01",
        "endDate": "2012/7/15",
        "description": "Developed and optimized templates and widgets for U.S. News projects such as Best Colleges, providing comprehensive technical support and building new site sections with Python/Pylons and jQuery based on UI designs."
      },
      {
        "jobTitle": "Senior Multimedia Designer/Developer",
        "company": "University of Maryland University College",
        "startDate": "2006/6/15",
        "endDate": "2011/4/15",
        "description": "Oversaw daily maintenance of UMUC's website and CMS (CommonSpot), managed marketing content, and developed mini-sites, splash pages, interactive content, video streaming, and HTML emails."
      }
    ]
  }
]
